app/controllers/content_pieces_controller.rb

  def index
    @content_pieces = ContentPiece.all
---
SELECT * FROM "content_pieces" WHERE (controller = 'content_pieces' AND view = 'index' AND area = 'main') ORDER BY created_at LIMIT 1

  def show
    @content_piece = ContentPiece.find(params[:id])
---
SELECT * FROM "content_pieces" WHERE ("content_pieces"."id" = 1)

  def create
    @content_piece = ContentPiece.new(params[:content_piece])
    if @content_piece.save
---
INSERT INTO "content_pieces" ("controller", "view", "area", "content", "created_at", "updated_at") VALUES('about', 'index', 'main', '<h2>hello world</h2>

  def edit
    @content_piece = ContentPiece.find(params[:id])
---
SELECT * FROM "content_pieces" WHERE ("content_pieces"."id" = 1)

  def update
    @content_piece = ContentPiece.find(params[:id])
    if @content_piece.update_attributes(params[:content_piece])
---
SELECT * FROM "content_pieces" WHERE ("content_pieces"."id" = 1)
UPDATE "content_pieces" SET "content" = '##hello world